# Pandasüêº

In [1]:
import pandas as pd

In [2]:
mylist = ['pune','mumbai','delhi','banglore','hyderbad']

In [3]:
d = {
    'p' : 300,
    'q' : 301,
    'r' : 302,
    's' : 303,
    't' : 305
}

In [4]:
import numpy as np

In [5]:
arr = np.arange(1000, 1005)
arr

array([1000, 1001, 1002, 1003, 1004])

In [6]:
pd.Series(mylist)

0        pune
1      mumbai
2       delhi
3    banglore
4    hyderbad
dtype: object

In [7]:

type(pd.Series(list))

pandas.core.series.Series

In [8]:
pd.Series(mylist,arr)

1000        pune
1001      mumbai
1002       delhi
1003    banglore
1004    hyderbad
dtype: object

In [9]:
pd.Series(arr,mylist)

pune        1000
mumbai      1001
delhi       1002
banglore    1003
hyderbad    1004
dtype: int32

In [10]:
pd.Series(data = arr, index = mylist)

pune        1000
mumbai      1001
delhi       1002
banglore    1003
hyderbad    1004
dtype: int32

In [11]:
d.keys

In [12]:
d.keys()

dict_keys(['p', 'q', 'r', 's', 't'])

In [13]:
pd.Series(d)

p    300
q    301
r    302
s    303
t    305
dtype: int64

In [14]:
pd.Series(arr,d)

p    1000
q    1001
r    1002
s    1003
t    1004
dtype: int32

In [15]:
pd.Series(d,arr)

1000   NaN
1001   NaN
1002   NaN
1003   NaN
1004   NaN
dtype: float64

In [16]:
ser1 = pd.Series({'pune' : 1,'mumbai' : 2,'delhi' : 8,'banglore': 3,'hyderbad' : 5})
ser2 = pd.Series({'pune' : 1,'mumbai' : 2,'delhi' : 8,'chennai': 3,'hyderbad' : 5})

In [17]:
ser1 + ser2

banglore     NaN
chennai      NaN
delhi       16.0
hyderbad    10.0
mumbai       4.0
pune         2.0
dtype: float64

In [18]:

my_df1 = pd.DataFrame(np.random.randn(20).reshape(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

In [19]:
type(my_df1)

pandas.core.frame.DataFrame

In [20]:
my_df1

          W         X         Y         Z
A  0.266592  0.619666 -1.021983  0.799188
B -0.010930  0.862320  0.025373  0.296432
C -0.467951  0.061730  0.989049 -0.811246
D -0.613671  1.163824 -0.698888  0.655051
E -1.573820 -1.820086 -0.159745 -1.683989

In [21]:
my_df1['W']

A    0.266592
B   -0.010930
C   -0.467951
D   -0.613671
E   -1.573820
Name: W, dtype: float64

In [22]:
type(my_df1['W'])

pandas.core.series.Series

In [23]:
type(my_df1[['X','Y']])

pandas.core.frame.DataFrame

In [24]:
my_df1[['X','Y']]

          X         Y
A  0.619666 -1.021983
B  0.862320  0.025373
C  0.061730  0.989049
D  1.163824 -0.698888
E -1.820086 -0.159745

In [25]:
my_df1.loc['D']

W   -0.613671
X    1.163824
Y   -0.698888
Z    0.655051
Name: D, dtype: float64

In [26]:
my_df1.iloc[3]

W   -0.613671
X    1.163824
Y   -0.698888
Z    0.655051
Name: D, dtype: float64

In [27]:
my_df1['W']>0

A     True
B    False
C    False
D    False
E    False
Name: W, dtype: bool

In [28]:
my_df1[my_df1['W']>0]

          W         X         Y         Z
A  0.266592  0.619666 -1.021983  0.799188

In [29]:
my_df1[my_df1['W']>0]['Y']

A   -1.021983
Name: Y, dtype: float64

In [30]:
int('1') + int('23')

24

In [31]:
int(True)

1

#

In [32]:
True + False + 5 + True

7

In [33]:
bool('r')

True

In [34]:
bool({})

False

In [35]:
bool(-8)

True

In [36]:
data = ['a','b','c','d','e']
result = []
for v in data:
    result.append(v.upper())
print(result)

['A', 'B', 'C', 'D', 'E']

In [37]:
'45'*5

'4545454545'

###

In [41]:
num1 = input("Enter a number: ")
num2 = int(num1[::-1])
num3= str(int(num1) + num2)
while num3 != num3[::-1]:
    num3 = str(int(num3) + int(num3[::-1]))
    print("Number is : ", num3)
    print("Revers is : ",num3[::-1])
print("Palindrom is : ", num3)

Enter a number: 34667
Number is :  124421
Revers is :  124421
Palindrom is :  124421

In [42]:
my_df1['W'].apply(lambda x : x>0)

A     True
B    False
C    False
D    False
E    False
Name: W, dtype: bool

In [43]:
my_df1['new'] = my_df1['W'] + my_df1['Y']

In [44]:
my_df1

          W         X         Y         Z       new
A  0.266592  0.619666 -1.021983  0.799188 -0.755391
B -0.010930  0.862320  0.025373  0.296432  0.014443
C -0.467951  0.061730  0.989049 -0.811246  0.521098
D -0.613671  1.163824 -0.698888  0.655051 -1.312559
E -1.573820 -1.820086 -0.159745 -1.683989 -1.733565

In [45]:
my_df1.drop('new',axis = 1)

          W         X         Y         Z
A  0.266592  0.619666 -1.021983  0.799188
B -0.010930  0.862320  0.025373  0.296432
C -0.467951  0.061730  0.989049 -0.811246
D -0.613671  1.163824 -0.698888  0.655051
E -1.573820 -1.820086 -0.159745 -1.683989

In [50]:
my_df1.drop('new',axis =1, inplace = True)
# droppping colums permanantely

In [51]:
my_df1.loc[['A','B'],['W','X']]

          W         X
A  0.266592  0.619666
B -0.010930  0.862320

In [52]:
newmind = 'CA NY WY OR CO'.split()

In [53]:
newmind

['CA', 'NY', 'WY', 'OR', 'CO']